Revit 2026 API

# ViewportLabelLineLength Property

---

The length of the viewport label line in sheet space, measured in feet.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double LabelLineLength { get; set; }
```
```vb
Public Property LabelLineLength As Double
	Get
	Set
```
```cpp
public:
property double LabelLineLength {
	double get ();
	void set (double value);
}
```
```fsharp
member LabelLineLength : float with get, set
```

#### Property Value

Double

It can be negative. The sign depends on the direction of the label line.

#### Reference

Viewport Class

Autodesk.Revit.DB Namespace